fio/fio_ceph/map/disk_bare/log_37/rbd0/fio_write_512k.log
test: (g=0): rw=write, bs=(R) 512KiB-512KiB, (W) 512KiB-512KiB, (T) 512KiB-512KiB, ioengine=libaio, iodepth=64
fio-3.1
Starting 1 process

test: (groupid=0, jobs=1): err= 0: pid=77841: Mon Jul 30 14:16:39 2018
  write: IOPS=891, BW=446MiB/s (468MB/s)(10.0GiB/22961msec)
    slat (usec): min=23, max=1297, avg=67.73, stdev=24.50
    clat (msec): min=4, max=231, avg=71.67, stdev=38.33
     lat (msec): min=4, max=231, avg=71.74, stdev=38.33
    clat percentiles (msec):
     |  1.00th=[    8],  5.00th=[   15], 10.00th=[   21], 20.00th=[   34],
     | 30.00th=[   46], 40.00th=[   59], 50.00th=[   71], 60.00th=[   84],
     | 70.00th=[   95], 80.00th=[  107], 90.00th=[  122], 95.00th=[  134],
     | 99.00th=[  165], 99.50th=[  174], 99.90th=[  199], 99.95th=[  205],
     | 99.99th=[  222]
   bw (  KiB/s): min=355328, max=524312, per=100.00%, avg=457561.31, stdev=48477.57, samples=45
   iops        : min=  694, max= 1024, avg=893.60, stdev=94.65, samples=45
  lat (msec)   : 10=2.21%, 20=7.21%, 50=24.11%, 100=40.76%, 250=25.71%
  cpu          : usr=3.66%, sys=3.45%, ctx=16940, majf=0, minf=28
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.2%, >=64=99.7%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwt: total=0,20480,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=446MiB/s (468MB/s), 446MiB/s-446MiB/s (468MB/s-468MB/s), io=10.0GiB (10.7GB), run=22961-22961msec

Disk stats (read/write):
  rbd0: ios=21/20413, merge=0/0, ticks=11/1458474, in_queue=1461093, util=99.53%